RhinoInside.Revit API Documentation
GeometryEncoder.ToXYZ Method (Point3f)
 Converts the specified Rhino.Geometry.Point3f to an equivalent Autodesk.Revit.DB.XYZ.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8026
Syntax
public static Autodesk.Revit.DB.XYZ ToXYZ(
	this Rhino.Geometry.Point3f point
)
@staticmethod
def ToXYZ(
	point: Rhino.Geometry.Point3f
) -> Autodesk.Revit.DB.XYZ
Parameters
point
Type: Rhino.Geometry.Point3f
Rhino point to convert.
Return Value
Type: Autodesk.Revit.DB.XYZ
Revit point that is equivalent to the provided Rhino point.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Rhino.Geometry.Point3f. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToXYZ(Point3f) as extension method:
1using DB = Autodesk.Revit.DB;
2using RhinoInside.Revit.Convert.Geometry;
3
4DB.XYZ revitXYZPoint = rhinoPoint3f.ToXYZ();
1import clr
2clr.AddReference("RevitAPI")
3clr.AddReference("RhinoInside.Revit")
4import Autodesk.Revit.DB as DB
5import RhinoInside.Revit.Convert.Geometry
6clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
7
8revit_xyzpoint: DB.XYZ = rhino_point3f.ToXYZ()
 Using ToXYZ(Point3f) as static method:
1using DB = Autodesk.Revit.DB;
2using RhinoInside.Revit.Convert.Geometry;
3
4DB.XYZ revitXYZPoint = GeometryEncoder.ToXYZ(rhinoPoint3f);
1import clr
2clr.AddReference("RevitAPI")
3clr.AddReference("RhinoInside.Revit")
4import Autodesk.Revit.DB as DB
5import RhinoInside.Revit.Convert.Geometry.GeometryEncoder as ge
6
7revit_xyzpoint: DB.XYZ = ge.ToXYZ(rhino_point3f)
See Also
Reference
GeometryEncoder Class
ToXYZ Overload
RhinoInside.Revit.Convert.Geometry Namespace